In [13]:
import os
import pandas as pd
import numpy as np

#df = pd.read_excel('narrative_raw.xlsx')
df = pd.read_csv('raw.csv',index_col = False, dtype = {"CountyCode": str,"DistrictCode": str,"SchoolCode": str})
df.head(2)

,CountyCode,CountyName,DistrictCode,DistrictName,Student_Teacher_District,Student_Admin_District,Teacher_Admin_District,Student_Librarian_District,Student_Nurse_District,Student_Counselor_District,Student_ChildStudy_District
0,01,ATLANTIC,0010,ABSECON CITY,13:1,174:1,14:1,868:1,868:1,868:1,434:1
1,01,ATLANTIC,0110,ATLANTIC CITY,11:1,224:1,21:1,992:1,631:1,347:1,434:1

### Check number of columns and rows

In [14]:
df.shape

(675, 11)

### Adding columns from 2016-17 table

In [15]:
#df['Principal'] = 'NA'
#df['SchoolAddress1'] = 'NA'
#df['SchoolAddress2'] = 'NA'
df['Year'] = '2017-18'

### Check if columns are added properly

In [16]:
df.head(2)

,CountyCode,CountyName,DistrictCode,DistrictName,Student_Teacher_District,Student_Admin_District,Teacher_Admin_District,Student_Librarian_District,Student_Nurse_District,Student_Counselor_District,Student_ChildStudy_District,Year
0,01,ATLANTIC,0010,ABSECON CITY,13:1,174:1,14:1,868:1,868:1,868:1,434:1,2017-18
1,01,ATLANTIC,0110,ATLANTIC CITY,11:1,224:1,21:1,992:1,631:1,347:1,434:1,2017-18

### Check missing values

In [17]:
df.isnull().sum()

CountyCode                     0
CountyName                     0
DistrictCode                   0
DistrictName                   0
Student_Teacher_District       0
Student_Admin_District         0
Teacher_Admin_District         0
Student_Librarian_District     0
Student_Nurse_District         0
Student_Counselor_District     0
Student_ChildStudy_District    0
Year                           0
dtype: int64

### Fill missing values

In [6]:
#df = df.fillna('NA')

### Check again if missing values are dealt properly

In [6]:
#df.isnull().sum()

### Check for meaningless values such as '**','N'

In [18]:
df['Student_Teacher_District'] = df['Student_Teacher_District'].replace('**','NA')
df['Student_Teacher_District'] = df['Student_Teacher_District'].replace('N','NA')

df['Student_Admin_District'] = df['Student_Admin_District'].replace('**','NA')
df['Student_Admin_District'] = df['Student_Admin_District'].replace('N','NA')

df['Student_Librarian_District'] = df['Student_Librarian_District'].replace('**','NA')
df['Student_Librarian_District'] = df['Student_Librarian_District'].replace('N','NA')

df['Student_Nurse_District'] = df['Student_Nurse_District'].replace('**','NA')
df['Student_Nurse_District'] = df['Student_Nurse_District'].replace('N','NA')

df['Student_Nurse_District'] = df['Student_Nurse_District'].replace('**','NA')
df['Student_Nurse_District'] = df['Student_Nurse_District'].replace('N','NA')

df['Student_Counselor_District'] = df['Student_Counselor_District'].replace('**','NA')
df['Student_Counselor_District'] = df['Student_Counselor_District'].replace('N','NA')

df['Student_ChildStudy_District'] = df['Student_ChildStudy_District'].replace('**','NA')
df['Student_ChildStudy_District'] = df['Student_ChildStudy_District'].replace('N','NA')

### Check Data types of all columns

In [19]:
df.dtypes

CountyCode                     object
CountyName                     object
DistrictCode                   object
DistrictName                   object
Student_Teacher_District       object
Student_Admin_District         object
Teacher_Admin_District         object
Student_Librarian_District     object
Student_Nurse_District         object
Student_Counselor_District     object
Student_ChildStudy_District    object
Year                           object
dtype: object

### Change Data types

In [8]:
#df["Federal"] = df["Federal"].astype(int)

### Check the changed data types

In [7]:
#df.dtypes

### Get a look at final data

In [20]:
df.head()

,CountyCode,CountyName,DistrictCode,DistrictName,Student_Teacher_District,Student_Admin_District,Teacher_Admin_District,Student_Librarian_District,Student_Nurse_District,Student_Counselor_District,Student_ChildStudy_District,Year
0,01,ATLANTIC,0010,ABSECON CITY,13:1,174:1,14:1,868:1,868:1,868:1,434:1,2017-18
1,01,ATLANTIC,0110,ATLANTIC CITY,11:1,224:1,21:1,992:1,631:1,347:1,434:1,2017-18
2,01,ATLANTIC,0120,ATLANTIC CO VOCATIONAL,12:1,177:1,15:1,1591:1,530:1,227:1,796:1,2017-18
3,01,ATLANTIC,0125,ATLANTIC CO SPECIAL SERV,6:1,50:1,8:1,NA,117:1,NA,39:1,2017-18
4,01,ATLANTIC,0570,BRIGANTINE CITY,8:1,96:1,11:1,NA,287:1,287:1,144:1,2017-18

In [21]:
#df1.to_csv(df1.csv)
df.to_csv('StudentToStaffRatios.csv', encoding='utf-8', index=False)

In [ ]:
#x= df1.to_excel('output1.xlsx')  # doctest: +SKIP